import pytest
import allure
from pages.main_page import MainPage

class TestMainPage:

    @allure.title("Проверка выпадающего списка 'Вопросы о важном'")
    @pytest.mark.parametrize(
        "num, expected_answer",
        [
            (0, "Сутки — 400 рублей. Оплата курьеру — наличными или картой."),
            (1, "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."),
            (2, "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."),
            (3, "Только начиная с завтрашнего дня. Но скоро станем расторопнее."),
            (4, "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."),
            (5, "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."),
            (6, "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."),
            (7, "Да, обязательно. Всем самокатов! И Москве, и Московской области.")
        ]
    )
    def test_accordion_questions(self, driver, num, expected_answer):
        main_page = MainPage(driver)
        
        # 1: Открываем страницу
        main_page.open_main_page()
        
        # 2: Кликаем на нужный вопрос
        main_page.click_question(num)
        
        # 3: Получаем текст ответа
        actual_answer = main_page.get_answer_text(num)
        
        # 4: Проверяем что текст совпадает с ожидаемым
        assert actual_answer == expected_answer, f"Текст ответа для вопроса {num} не совпадает!"